Repository: tgcrypt/woocommerce-icredit
Catalog: languages/woocommerce_icredit-*.po
Languages: he_il

source: iCredit Payment
he_il: תשלום באמצעות iCredit

source: Enable/Disable
he_il: הפעל / השבת

source: Enable iCredit Payment
he_il: אפשר תשלומים באמצעות iCredit

source: Payment Method Title
he_il: שם אמצעי התשלום

source: This controls the title which the user sees during checkout.
he_il: זו הכותרת שהגולש יראה בזמן סיום הרכישה

source: Payment Method Description
he_il: תיאור אמצעי התשלום

source: Pay via iCredit - secure payment page.
he_il: שלם באמצעות כרטיס אשראי דרך iCredit

source: Group Private Token
he_il: מזהה דף תשלום

source: Use test mode
he_il: כדי להשתמש במצב בדיקה יש להכניס מזהה דף תשלום של סביבת בדיקות

source: Test Group Private Token (optional)
he_il: מזהה דף תשלום - סביבת בדיקות

source: Test Mode
he_il: מצב בדיקה

source: Max Payments
he_il: מספר תשלומים אפשרי

source: Credit From Payment
he_il: עסקת קרדיט מתשלום

source: Create Token
he_il: יצירת טוקן לעסקה

source: Document Language
he_il: שפת המסמך

source: Select the language the invoice should be created. Select "By Country Code" to create Hebrew documents for Israel and English for any other country.
he_il: בחר את השפה בה תופק החשבונית. בחר "על-פי מדינה" על-מנת ליצור מסמכים בעברית עבור לקוחות מישראל ומסמכים באנגלית עבור שאר הלקוחות.

source: Always Hebrew
he_il: תמיד בעברית

source: Always English
he_il: תמיד באנגלית

source: By Country Code
he_il: על-פי מדינה

source: Exampt VAT
he_il: פטור ממע"מ

source: Select if to exempt VAT.
he_il: בחר האם לתת פטור ממע"מ

source: Always Not Exempt
he_il: בשום מקרה אין לתת פטור ממע"מ

source: Always Exempt
he_il: תמיד יש לתת פטור ממע"מ

source: By Shipping Country
he_il: על-פי המדינה המופיעה בכתובת המשלוח

source: By Billing Country
he_il: על-פי מדינה המופיעה בכתובת התשלום

source: By Shipping or Billing Country
he_il: על-פי כתובת התשלום או כתובת המשלוח

source: <h2>Payment View</h2>
he_il: <h2>תצוגת התשלום</h2>

source: PopUp Mode
he_il: מצב פופ-אפ

source: Use PopUp for payment? (or Redirect)
he_il: האם להציג את חלון התשלום בפופ-אפ? (אם לא תתבצע הפניה לעמוד התשלום)

source: Redirect
he_il: הפניה

source: iFrame
he_il: מסגרת iFrame

source: Lightbox PopUp
he_il: חלון צף Lightbox

source: iFrame Height
he_il: גובה המסגרת iFrame

source: iFrame Width
he_il: רוחב מסגרת iFrame

source: i.e 100% or 300px. Default: 100% .
he_il: למשל 100% או 300px . ברירת המחדל: 100%

source: PopUp Height
he_il: גובה החלון הצף

source: i.e 400px. Default: auto (min. height is 600px
he_il: למשל 400px. ברירת המחדל: אוטומטי, מינימום 600px

source: PopUp Width
he_il: רוחב החלון הצף

source: i.e 600px. Default: 600px
he_il: למשל 600px. ברירת המחדל: 600px

source: Hide Items on Payment Page
he_il: הסתרת המוצרים בעמוד התשלום

source: Thank You page URL
he_il: כתובת דף תודה

source: Leave empty to use iCredit Group Settings. <br />Leave iCredit Group Redirect URL Setting empty in order to use WooCommerce default thank you page (<strong>recommended</strong>).
he_il: השאר ריק על-מנת להשתמש בהגדרות שב-iCredit . מומלץ להשאיר גם את הגדרת iCredit להפניה ריקה על-מנת להשתמש בדף התודה של המערכת.

source: <h2>Transmitted Information</h2>
he_il: <h2>מידע שנשלח</h2>

source: First Name
he_il: שם פרטי

source: Last Name
he_il: שם משפחה

source: e-mail Address
he_il: כתובת דוא"ל

source: Address
he_il: כתובת

source: City
he_il: עיר

source: Zip Code
he_il: מיקוד

source: Phone Number
he_il: מספר טלפון

source: Company Name
he_il: שם החברה

source: User Comments
he_il: הערות הלקוח
